=TEXT(J1,"yyyy-MM-dd HH:mm:ss")

=CONCATENATE("insert into 变位信息定义库(标识,描述,厂站ID,合标识,分标识,设备,等级,类型)values('",A1,"','",B1,"','",C1,"','",D1,"','",E1,"','",F1,"','",G1,"','",H1,"')")
=CONCATENATE("insert into 故障代码库(标识,故障代码,描述,厂站ID,故障状态,告警等级,设备标识,延时时间,首伴标识)values('",A1,"','",B1,"','",C1,"','",D1,"','",E1,"','",F1,"','",G1,"','",H1,"','",I1,"')")
=CONCATENATE("insert into 故障事件当日库(ID_KEY,厂站ID,标识,描述,状态,设备标识,等级,风机类型,风机标识,起始时间,结束时间,处理标识,操作指导,备注)values('",A1,"','",B1,"','",C1,"','",D1,"','",E1,"','",F1,"','",G1,"','",H1,"','",I1,"','",TEXT(J1,"yyyy-MM-dd HH:mm:ss"),"','",TEXT(K1,"yyyy-MM-dd HH:mm:ss"),"','",L1,"','",M1,"','",N1,"')")
=CONCATENATE("insert into 故障事件历史库(ID_KEY,厂站ID,标识,描述,状态,设备标识,等级,风机类型,风机标识,起始时间,结束时间,处理标识,操作指导,备注)values('",A1,"','",B1,"','",C1,"','",D1,"','",E1,"','",F1,"','",G1,"','",H1,"','",I1,"','",TEXT(J1,"yyyy-MM-dd HH:mm:ss"),"','",TEXT(K1,"yyyy-MM-dd HH:mm:ss"),"','",L1,"','",M1,"','",N1,"')")


=CONCATENATE("insert into 故障信息定义库(序号,标识,条件,描述,厂站ID,故障告警,告警等级,风机类型,风机标识,设备标识,状态测点,延时时间,上限值,下限值,故障类型,首伴标识)values('",A1,"','",B1,"','",C1,"','",D1,"','",E1,"','",F1,"','",G1,"','",H1,"','",I1,"',",J1,",'",K1,"',",L1,",",M1,",",N1,",'",O1,"',",P1,")")

=CONCATENATE("insert into 遥信变位事件历史库(ID_KEY,厂站ID,YXID,值名,状态,时间,毫秒,comflag,备注,等级)values('",A1,"','",B1,"','",C1,"','",D1,"','",E1,"','",TEXT(F1,"yyyy-MM-dd HH:mm:ss"),"','",G1,"','",H1,"','",I1,"','",J1,"')")

